Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/Atmel.SAMV71_DFP.pdsc
      <condition id="ATSAMV71J20">
         <require Dvendor="Atmel:3" Dname="ATSAMV71J20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71Q20">
         <require Dvendor="Atmel:3" Dname="ATSAMV71Q20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71J19B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71J19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71J19">
         <require Dvendor="Atmel:3" Dname="ATSAMV71J19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71N19">
         <require Dvendor="Atmel:3" Dname="ATSAMV71N19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71Q21">
         <require Dvendor="Atmel:3" Dname="ATSAMV71Q21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71N21">
         <require Dvendor="Atmel:3" Dname="ATSAMV71N21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71N20">
         <require Dvendor="Atmel:3" Dname="ATSAMV71N20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71J21B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71J21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71J20B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71J20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71Q20B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71Q20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71Q19">
         <require Dvendor="Atmel:3" Dname="ATSAMV71Q19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71N19B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71N19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71Q19B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71Q19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71Q21B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71Q21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71N21B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71N21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV71N20B">
         <require Dvendor="Atmel:3" Dname="ATSAMV71N20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71J21">
         <description>Headers and startup code for Atmel ATSAMV71J21</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71j21.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71j21.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71j21_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71j21_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71j21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71j21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71j21/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71j21/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71J20">
         <description>Headers and startup code for Atmel ATSAMV71J20</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71j20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71j20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71j20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71j20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71j20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71j20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71j20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71j20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71Q20">
         <description>Headers and startup code for Atmel ATSAMV71Q20</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71q20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71q20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71q20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71q20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71q20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71q20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71q20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71q20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71J19B">
         <description>Headers and startup code for Atmel ATSAMV71J19B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71j19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71j19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71j19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71j19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71j19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71j19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71j19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71j19b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71J19">
         <description>Headers and startup code for Atmel ATSAMV71J19</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71j19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71j19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71j19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71j19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71j19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71j19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71j19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71j19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71N19">
         <description>Headers and startup code for Atmel ATSAMV71N19</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71n19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71n19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71n19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71n19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71n19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71n19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71n19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71n19/flash.icf" attr="config"/>
         </files>
      </component>
