Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/Atmel.SAMV71_DFP.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71J21B">
         <description>Headers and startup code for Atmel ATSAMV71J21B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71j21b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71j21b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71j21b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71j21b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71j21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71j21b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71j21b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71j21b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71J20B">
         <description>Headers and startup code for Atmel ATSAMV71J20B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71j20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71j20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71j20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71j20b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71j20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71j20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71j20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71j20b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71Q20B">
         <description>Headers and startup code for Atmel ATSAMV71Q20B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71q20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71q20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71q20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71q20b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71q20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71q20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71q20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71q20b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71Q19">
         <description>Headers and startup code for Atmel ATSAMV71Q19</description>
         <files>
            <file condition="C" category="include" name="samv71/include"/>
            <file condition="C" category="header" name="samv71/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/gcc/startup_samv71q19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71/gcc/system_samv71q19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71/gcc/gcc/samv71q19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71/gcc/gcc/samv71q19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71/armcc/samv71/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/iar/startup_samv71q19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71/iar/system_samv71q19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71/iar/config/linker/Microchip/atsamv71q19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71/iar/config/linker/Microchip/atsamv71q19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71N19B">
         <description>Headers and startup code for Atmel ATSAMV71N19B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71n19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71n19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71n19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71n19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71n19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71n19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71n19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71n19b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71Q19B">
         <description>Headers and startup code for Atmel ATSAMV71Q19B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71q19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71q19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71q19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71q19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71q19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71q19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71q19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71q19b/flash.icf" attr="config"/>
         </files>
      </component>
