Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/Atmel.SAMV71_DFP.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71Q21B">
         <description>Headers and startup code for Atmel ATSAMV71Q21B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71q21b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71q21b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71q21b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71q21b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71q21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71q21b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71q21b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71q21b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71N21B">
         <description>Headers and startup code for Atmel ATSAMV71N21B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71n21b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71n21b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71n21b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71n21b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71n21b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71n21b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71n21b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71n21b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="2.4.0" condition="ATSAMV71N20B">
         <description>Headers and startup code for Atmel ATSAMV71N20B</description>
         <files>
            <file condition="C" category="include" name="samv71b/include"/>
            <file condition="C" category="header" name="samv71b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv71b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv71b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/gcc/startup_samv71n20b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv71b/gcc/system_samv71n20b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv71b/gcc/gcc/samv71n20b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv71b/gcc/gcc/samv71n20b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/system_SAMV71.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv71b/armcc/samv71b/armcc/arm/startup_SAMV71.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/iar/startup_samv71n20b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv71b/iar/system_samv71n20b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv71b/iar/config/linker/Microchip/atsamv71n20b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv71b/iar/config/linker/Microchip/atsamv71n20b/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
